## OpenTofu Plan: platform/security/prod-gdpr

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.main.azurerm_log_analytics_workspace.siem_1[0] will be created
  + resource "azurerm_log_analytics_workspace" "siem_1" {
      + allow_resource_only_permissions         = true
      + daily_quota_gb                          = 0.5
      + id                                      = (known after apply)
      + immediate_data_purge_on_30_days_enabled = true
      + internet_ingestion_enabled              = true
      + internet_query_enabled                  = true
      + local_authentication_disabled           = (known after apply)
      + local_authentication_enabled            = false
      + location                                = "westeurope"
      + name                                    = "log-siem-prod-weu-01"
      + primary_shared_key                      = (sensitive value)
      + resource_group_name                     = "rg-siem-prod-weu"
      + retention_in_days                       = 30
      + secondary_shared_key                    = (sensitive value)
      + sku                                     = "PerGB2018"
      + tags                                    = {
          + "compliance_scope" = "gdpr"
          + "costcenter"       = "cc-it-platform"
          + "env"              = "prod"
          + "managed_by"       = "opentofu"
          + "org"              = "kneadcode"
          + "owner"            = "platform-engineering"
          + "portfolio"        = "coruscant"
          + "purpose"          = "siem-hot"
          + "region"           = "westeurope"
          + "regionrole"       = "active"
          + "workload"         = "siem"
        }
      + workspace_id                            = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.main.azurerm_management_lock.siem_rg[0] will be created
  + resource "azurerm_management_lock" "siem_rg" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "lock-rg-siem-prod-weu-cannot-delete"
      + scope      = (known after apply)
    }

  # module.main.azurerm_resource_group.siem[0] will be created
  + resource "azurerm_resource_group" "siem" {
      + id         = (known after apply)
      + location   = "westeurope"
      + managed_by = "opentofu"
      + name       = "rg-siem-prod-weu"
      + tags       = {
          + "compliance_scope" = "gdpr"
          + "costcenter"       = "cc-it-platform"
          + "env"              = "prod"
          + "managed_by"       = "opentofu"
          + "org"              = "kneadcode"
          + "owner"            = "platform-engineering"
          + "portfolio"        = "coruscant"
          + "purpose"          = "siem"
          + "region"           = "westeurope"
          + "regionrole"       = "active"
          + "workload"         = "siem"
        }
    }

  # module.main.azurerm_sentinel_log_analytics_workspace_onboarding.siem_1[0] will be created
  + resource "azurerm_sentinel_log_analytics_workspace_onboarding" "siem_1" {
      + customer_managed_key_enabled = false
      + id                           = (known after apply)
      + workspace_id                 = (known after apply)
    }

  # module.main.azurerm_storage_account.siem_archive_1[0] will be created
  + resource "azurerm_storage_account" "siem_archive_1" {
      + access_tier                        = "Cool"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = true
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = false
      + local_user_enabled                 = false
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = (sensitive value)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-siem-prod-weu"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = false
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "compliance_scope" = "gdpr"
          + "costcenter"       = "cc-it-platform"
          + "env"              = "prod"
          + "managed_by"       = "opentofu"
          + "org"              = "kneadcode"
          + "owner"            = "platform-engineering"
          + "portfolio"        = "coruscant"
          + "purpose"          = "platform-siem-archive"
          + "region"           = "westeurope"
          + "regionrole"       = "active"
          + "workload"         = "siem"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days                     = 7
              + permanent_delete_enabled = false
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing {
          + choice                      = "MicrosoftRouting"
          + publish_internet_endpoints  = false
          + publish_microsoft_endpoints = false
        }

      + sas_policy {
          + expiration_action = "Block"
          + expiration_period = "0.00:01:00"
        }

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.main.azurerm_storage_management_policy.siem_archive_1[0] will be created
  + resource "azurerm_storage_management_policy" "siem_archive_1" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "diag-cool-cold-archive-delete"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = 365
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = 90
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                  + tier_to_cold_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cold_after_days_since_modification_greater_than        = 30
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = -1
                }
            }

          + filters {
              + blob_types = [
                  + "blockBlob",
                ]
            }
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + siem_law_name        = "log-siem-prod-weu-01"
  + siem_rg_name         = "rg-siem-prod-weu"
  + siem_st_archive_name = (sensitive value)
```